zephyrproject-rtos/hal_espressif/zephyr/esp32h2/src/bt/esp_bt_adapter.c
/*
 * SPDX-FileCopyrightText: 2015-2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <stddef.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>

#include "sdkconfig.h"
#include "esp_types.h"
#include "esp_mac.h"
#include "esp_random.h"
#include "esp_attr.h"
#include "esp_phy_init.h"
#include "esp_bt.h"
#include "esp_err.h"
#include "esp_cpu.h"
#include "esp_private/periph_ctrl.h"
#include "bt_osi_mem.h"
#include "esp_clk_tree.h"
#include "esp_private/esp_clk.h"
#include "esp_private/esp_clk_tree_common.h"
#include "soc/soc_caps.h"
#include "soc/rtc.h"
#include "soc/soc_memory_layout.h"
#include "private/esp_coexist_internal.h"
#include "esp_timer.h"
#include "esp_sleep.h"
#include "esp_rom_sys.h"
#include "esp_private/phy.h"
#include "hal/efuse_hal.h"
#include "soc/rtc.h"
#include "esp_heap_adapter.h"
#include "nimble/nimble_port_zephyr.h"
#include "esp_private/esp_modem_clock.h"
#include "nimble/nimble_npl_os.h"
#include "esp_hci_transport.h"
#include "os/endian.h"
#include "ble_priv.h"

#include <zephyr/kernel.h>
#include <zephyr/sys/printk.h>
#include <zephyr/random/random.h>
#include <zephyr/drivers/interrupt_controller/intc_esp32.h>

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(esp32_bt_adapter, CONFIG_LOG_DEFAULT_LEVEL);

#define OSI_COEX_VERSION     0x00010006
#define OSI_COEX_MAGIC_VALUE 0xFADEBEAD

#define EXT_FUNC_VERSION     0x20250415
#define EXT_FUNC_MAGIC_VALUE 0xA5A5A5A5

#define BT_ASSERT_PRINT ets_printf

struct osi_coex_funcs_t {
	uint32_t _magic;
	uint32_t _version;
	void (*_coex_wifi_sleep_set)(bool sleep);
	int (*_coex_core_ble_conn_dyn_prio_get)(bool *low, bool *high);
	void (*_coex_schm_status_bit_set)(uint32_t type, uint32_t status);
	void (*_coex_schm_status_bit_clear)(uint32_t type, uint32_t status);
};

struct ext_funcs_t {
	uint32_t ext_version;
	int (*_esp_intr_alloc)(int source, int flags, intr_handler_t handler, void *arg,
				   void **ret_handle);
	int (*_esp_intr_free)(void **ret_handle);
	void *(*_malloc)(size_t size);
	void (*_free)(void *p);
	int (*_task_create)(void *task_func, const char *name, uint32_t stack_depth, void *param,
				uint32_t prio, void *task_handle, uint32_t core_id);
	void (*_task_delete)(void *task_handle);
	void (*_osi_assert)(const uint32_t ln, const char *fn, uint32_t param1, uint32_t param2);
	uint32_t (*_os_random)(void);
	int (*_ecc_gen_key_pair)(uint8_t *public, uint8_t *priv);
	int (*_ecc_gen_dh_key)(const uint8_t *remote_pub_key_x, const uint8_t *remote_pub_key_y,
				   const uint8_t *local_priv_key, uint8_t *dhkey);
	uint32_t magic;
};

/* External functions or variables
 ************************************************************************
 */
extern int ble_osi_coex_funcs_register(struct osi_coex_funcs_t *coex_funcs);
extern int r_ble_controller_init(esp_bt_controller_config_t *cfg);
extern void esp_ble_controller_info_capture(uint32_t cycle_times);
extern int r_ble_controller_deinit(void);
extern int r_ble_controller_enable(uint8_t mode);
extern int r_ble_controller_disable(void);
extern int esp_register_ext_funcs (struct ext_funcs_t *);
extern void esp_unregister_ext_funcs (void);
extern int r_esp_ble_ll_set_public_addr(const uint8_t *addr);
extern int esp_register_npl_funcs (struct npl_funcs_t *p_npl_func);
extern void esp_unregister_npl_funcs (void);
extern void npl_zephyr_mempool_deinit(void);
extern uint32_t r_os_cputime_get32(void);
extern uint32_t r_os_cputime_ticks_to_usecs(uint32_t ticks);
extern void r_ble_lll_rfmgmt_set_sleep_cb(void *s_cb, void *w_cb, void *s_arg,
										  void *w_arg, uint32_t us_to_enabled);
extern void r_ble_rtc_wake_up_state_clr(void);
extern int os_msys_init(void);
extern void os_msys_deinit(void);
#if CONFIG_ESP32_BT_LE_LL_PEER_SCA_SET_ENABLE
extern void r_ble_ll_customize_peer_sca_set(uint16_t peer_sca);
#endif  /* CONFIG_ESP32_BT_LE_LL_PEER_SCA_SET_ENABLE */
extern int ble_sm_alg_gen_dhkey(const uint8_t *peer_pub_key_x,
								const uint8_t *peer_pub_key_y,
								const uint8_t *our_priv_key, uint8_t *out_dhkey);
extern int ble_sm_alg_gen_key_pair(uint8_t *pub, uint8_t *priv);
extern int r_ble_txpwr_set(esp_ble_enhanced_power_type_t power_type, uint16_t handle, int power_level);
extern int r_ble_txpwr_get(esp_ble_enhanced_power_type_t power_type, uint16_t handle);
extern int r_ble_get_npl_element_info(esp_bt_controller_config_t *cfg, ble_npl_count_info_t * npl_info);
extern char *ble_controller_get_compile_version(void);
extern int esp_ble_register_bb_funcs(void);
extern void esp_ble_unregister_bb_funcs(void);
extern uint32_t _bt_bss_start;
extern uint32_t _bt_bss_end;
extern uint32_t _bt_controller_bss_start;
extern uint32_t _bt_controller_bss_end;
extern uint32_t _bt_data_start;
extern uint32_t _bt_data_end;
extern uint32_t _bt_controller_data_start;
extern uint32_t _bt_controller_data_end;


/* Local Function Declaration
 *********************************************************************
 */
/* Local Function Declaration
 *********************************************************************
 */
static void coex_schm_status_bit_set_wrapper(uint32_t type, uint32_t status);
static void coex_schm_status_bit_clear_wrapper(uint32_t type, uint32_t status);
static int task_create_wrapper(void *task_func, const char *name, uint32_t stack_depth,
							   void *param, uint32_t prio, void *task_handle, uint32_t core_id);
static void task_delete_wrapper(void *task_handle);
static int esp_intr_alloc_wrapper(int source, int flags, intr_handler_t handler,
								  void *arg, void **ret_handle_in);
static int esp_intr_free_wrapper(void **ret_handle);
static void osi_assert_wrapper(const uint32_t ln, const char *fn, uint32_t param1, uint32_t param2);
static uint32_t osi_random_wrapper(void);
static int esp_ecc_gen_key_pair(uint8_t *pub, uint8_t *priv);
static int esp_ecc_gen_dh_key(const uint8_t *peer_pub_key_x, const uint8_t *peer_pub_key_y,
							  const uint8_t *our_priv_key, uint8_t *out_dhkey);

/* Static variable declare */
static DRAM_ATTR esp_bt_controller_status_t ble_controller_status = ESP_BT_CONTROLLER_STATUS_IDLE;

