zephyrproject-rtos/hal_espressif/zephyr/esp32h2/src/bt/esp_bt_adapter.c
	return rc;
}

void controller_sleep_deinit(void)
{

}

typedef enum {
	FILTER_DUPLICATE_PDUTYPE = BIT(0),
	FILTER_DUPLICATE_LENGTH = BIT(1),
	FILTER_DUPLICATE_ADDRESS = BIT(2),
	FILTER_DUPLICATE_ADVDATA = BIT(3),
	FILTER_DUPLICATE_DEFAULT = FILTER_DUPLICATE_PDUTYPE | FILTER_DUPLICATE_ADDRESS,
	FILTER_DUPLICATE_PDU_ALL = 0xF,
	FILTER_DUPLICATE_EXCEPTION_FOR_MESH = BIT(4),
	FILTER_DUPLICATE_AD_TYPE = BIT(5),
} disc_duplicate_mode_t;

extern void r_filter_duplicate_mode_enable(disc_duplicate_mode_t mode);
extern void r_filter_duplicate_mode_disable(disc_duplicate_mode_t mode);
extern void r_filter_duplicate_set_ring_list_max_num(uint32_t max_num);
extern void r_scan_duplicate_cache_refresh_set_time(uint32_t period_time);

int ble_vhci_disc_duplicate_mode_enable(int mode)
{
	/* TODO: use vendor hci to update */
	r_filter_duplicate_mode_enable(mode);
	return true;
}

int ble_vhci_disc_duplicate_mode_disable(int mode)
{
	/* TODO: use vendor hci to update */
	r_filter_duplicate_mode_disable(mode);
	return true;
}

int ble_vhci_disc_duplicate_set_max_cache_size(int max_cache_size)
{
	/* TODO: use vendor hci to update */
	r_filter_duplicate_set_ring_list_max_num(max_cache_size);
	return true;
}

int ble_vhci_disc_duplicate_set_period_refresh_time(int refresh_period_time)
{
	/* TODO: use vendor hci to update */
	r_scan_duplicate_cache_refresh_set_time(refresh_period_time);
	return true;
}

/**
 * @brief Config scan duplicate option mode from menuconfig (Adapt to the old configuration method.)
 */
void ble_controller_scan_duplicate_config(void)
{
	uint32_t duplicate_mode = FILTER_DUPLICATE_DEFAULT;
	uint32_t cache_size = 100;
#if CONFIG_ESP32_BT_LE_SCAN_DUPL == true
	cache_size = CONFIG_ESP32_BT_LE_LL_DUP_SCAN_LIST_COUNT;
	if (CONFIG_ESP32_BT_LE_SCAN_DUPL_TYPE == 0) {
		duplicate_mode = FILTER_DUPLICATE_ADDRESS | FILTER_DUPLICATE_PDUTYPE;
	} else if (CONFIG_ESP32_BT_LE_SCAN_DUPL_TYPE == 1) {
		duplicate_mode = FILTER_DUPLICATE_ADVDATA;
	} else if (CONFIG_ESP32_BT_LE_SCAN_DUPL_TYPE == 2) {
		duplicate_mode = FILTER_DUPLICATE_ADDRESS | FILTER_DUPLICATE_ADVDATA;
	}
	duplicate_mode |= FILTER_DUPLICATE_EXCEPTION_FOR_MESH;

	ble_vhci_disc_duplicate_set_period_refresh_time(CONFIG_ESP32_BT_LE_SCAN_DUPL_CACHE_REFRESH_PERIOD);
#endif

	ble_vhci_disc_duplicate_mode_disable(0xFFFFFFFF);
	ble_vhci_disc_duplicate_mode_enable(duplicate_mode);
	ble_vhci_disc_duplicate_set_max_cache_size(cache_size);
}

static void ble_rtc_clk_init(esp_bt_controller_config_t *cfg)
{
	if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_INVALID) {
#if CONFIG_ESP32_BT_LE_LP_CLK_SRC_MAIN_XTAL
		s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_MAIN_XTAL;
#else
#if CONFIG_RTC_CLK_SRC_INT_RC
		s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_RC_SLOW;
#elif CONFIG_RTC_CLK_SRC_EXT_CRYS
		if (rtc_clk_slow_src_get() == SOC_RTC_SLOW_CLK_SRC_XTAL32K) {
			s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_XTAL32K;
		} else {
			LOG_WRN("32.768kHz XTAL not detected, fall back to "
				"main XTAL as Bluetooth sleep clock");
			s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_MAIN_XTAL;
		}
#elif CONFIG_RTC_CLK_SRC_INT_RC32K
		s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_RC32K;
#elif CONFIG_RTC_CLK_SRC_EXT_OSC
		s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_EXT32K;
#else
		LOG_ERR("Unsupported clock source");
		assert(0);
#endif
#endif /* CONFIG_ESP32_BT_LE_LP_CLK_SRC_MAIN_XTAL */
	}

	if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_MAIN_XTAL) {
		cfg->rtc_freq = s_bt_lpclk_freq;
	} else if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_XTAL32K) {
		cfg->rtc_freq = 32768;
	} else if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_RC_SLOW) {
		cfg->rtc_freq =	esp_clk_tree_lp_slow_get_freq_hz(ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED) / 5;
		cfg->ble_ll_sca = 3000;
	} else if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_RC32K) {
		cfg->rtc_freq = 32000;
	} else if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_EXT32K) {
		cfg->rtc_freq = 32000;
	}
	esp_bt_rtc_slow_clk_select(s_bt_lpclk_src);
}

esp_err_t esp_bt_controller_init(esp_bt_controller_config_t *cfg)
{
	uint8_t mac[6];
	esp_err_t ret = ESP_OK;
	ble_npl_count_info_t npl_info;
	uint8_t hci_transport_mode;

	memset(&npl_info, 0, sizeof(ble_npl_count_info_t));
	if (ble_controller_status != ESP_BT_CONTROLLER_STATUS_IDLE) {
		LOG_WRN("invalid controller state");
		return ESP_ERR_INVALID_STATE;
	}

	if (!cfg) {
		LOG_WRN("cfg is NULL");
		return ESP_ERR_INVALID_ARG;
	}

	ret = esp_register_ext_funcs(&ext_funcs_ro);
	if (ret != ESP_OK) {
		LOG_WRN("register extend functions failed");
		return ret;
	}

	/* Initialize the function pointers for OS porting */
	npl_zephyr_funcs_init();
	struct npl_funcs_t *p_npl_funcs = npl_zephyr_funcs_get();
	if (!p_npl_funcs) {
		LOG_WRN("npl functions get failed");
		return ESP_ERR_INVALID_ARG;
	}

	ret = esp_register_npl_funcs(p_npl_funcs);
	if (ret != ESP_OK) {
		LOG_WRN("npl functions register failed");
		goto free_mem;
	}

	r_ble_get_npl_element_info(cfg, &npl_info);
	npl_zephyr_set_controller_npl_info(&npl_info);
	if (npl_zephyr_mempool_init() != 0) {
		LOG_WRN("npl mempool init failed");
		ret = ESP_ERR_INVALID_ARG;
		goto free_mem;
	}

	/* Enable BT-related clocks */
	modem_clock_module_enable(PERIPH_BT_MODULE);
	modem_clock_module_mac_reset(PERIPH_BT_MODULE);
	/* Select slow clock source for BT module */
	ble_rtc_clk_init(cfg);

	if (ble_osi_coex_funcs_register((struct osi_coex_funcs_t *)&s_osi_coex_funcs_ro) != 0) {
		LOG_WRN("osi coex funcs reg failed");
		ret = ESP_ERR_INVALID_ARG;
		goto modem_deint;
	}

#if CONFIG_SW_COEXIST_ENABLE
	coex_init();
#endif /* CONFIG_SW_COEXIST_ENABLE */

	ret = esp_ble_register_bb_funcs();
	if (ret != ESP_OK) {
		LOG_WRN("esp_ble_register_bb_funcs failed %d", ret);
		goto modem_deint;
	}

	LOG_INF("ble controller commit:[%s]", ble_controller_get_compile_version());

	ret = r_ble_controller_init(cfg);
	if (ret != ESP_OK) {
		LOG_WRN("r_ble_controller_init failed %d", ret);
		goto modem_deint;
	}

#if CONFIG_ESP32_BT_LE_LL_PEER_SCA_SET_ENABLE
	r_ble_ll_customize_peer_sca_set(CONFIG_ESP32_BT_LE_LL_PEER_SCA);
#endif

	ret = ble_stack_initEnv();
	if (ret != ESP_OK) {
		LOG_WRN("ble_stack_initEnv failed %d", ret);
		goto free_controller;
	}

	ble_controller_scan_duplicate_config();

	ret = os_msys_init();
	if (ret != ESP_OK) {
		LOG_WRN("msys_init failed %d", ret);
		goto free_controller;
	}

	ret = controller_sleep_init();
	if (ret != ESP_OK) {
		LOG_WRN("controller_sleep_init failed %d", ret);
		goto free_controller;
	}

	esp_read_mac((uint8_t *)mac, ESP_MAC_BT);
	LOG_INF("Bluetooth MAC: %02x:%02x:%02x:%02x:%02x:%02x", mac[0], mac[1], mac[2], mac[3],
		mac[4], mac[5]);
	swap_in_place(mac, 6);
	r_esp_ble_ll_set_public_addr(mac);

	ble_controller_status = ESP_BT_CONTROLLER_STATUS_INITED;

#if CONFIG_ESP32_BT_LE_HCI_INTERFACE_USE_RAM
	hci_transport_mode = HCI_TRANSPORT_VHCI;
#endif /* CONFIG_ESP32_BT_LE_HCI_INTERFACE_USE_RAM */
	ret = hci_transport_init(hci_transport_mode);
	if (ret) {
		LOG_WRN("hci transport init failed %d", ret);
		goto free_controller;
	}

	return ESP_OK;
free_controller:
	hci_transport_deinit();
	controller_sleep_deinit();
	os_msys_deinit();
	ble_stack_deinitEnv();
	r_ble_controller_deinit();
modem_deint:
	esp_ble_unregister_bb_funcs();
	modem_clock_deselect_lp_clock_source(PERIPH_BT_MODULE);
	modem_clock_module_disable(PERIPH_BT_MODULE);
free_mem:
	npl_zephyr_mempool_deinit();
	esp_unregister_npl_funcs();
	npl_zephyr_funcs_deinit();
	esp_unregister_ext_funcs();
	return ret;
}

