zephyrproject-rtos/hal_espressif/zephyr/esp32h2/src/bt/esp_bt_adapter.c
esp_err_t esp_bt_controller_deinit(void)
{
	if ((ble_controller_status < ESP_BT_CONTROLLER_STATUS_INITED) ||
		(ble_controller_status >= ESP_BT_CONTROLLER_STATUS_ENABLED)) {
		LOG_WRN("invalid controller state");
		return ESP_FAIL;
	}

	hci_transport_deinit();
	controller_sleep_deinit();

	os_msys_deinit();

	modem_clock_deselect_lp_clock_source(PERIPH_BT_MODULE);
	modem_clock_module_disable(PERIPH_BT_MODULE);

	ble_stack_deinitEnv();
	r_ble_controller_deinit();
	esp_ble_unregister_bb_funcs();

	esp_unregister_npl_funcs();

	esp_unregister_ext_funcs();

	/* De-initialize npl functions */
	npl_zephyr_funcs_deinit();

	npl_zephyr_mempool_deinit();

	ble_controller_status = ESP_BT_CONTROLLER_STATUS_IDLE;

	return ESP_OK;
}

esp_err_t esp_bt_controller_enable(esp_bt_mode_t mode)
{
	esp_err_t ret = ESP_OK;

	if (mode != ESP_BT_MODE_BLE) {
		LOG_WRN("invalid controller mode");
		return ESP_FAIL;
	}
	if (ble_controller_status != ESP_BT_CONTROLLER_STATUS_INITED) {
		LOG_WRN("invalid controller state");
		return ESP_FAIL;
	}
	if (!s_ble_active) {
		esp_phy_enable(PHY_MODEM_BT);
		s_ble_active = true;
	}
	esp_btbb_enable();
#if CONFIG_SW_COEXIST_ENABLE
	coex_enable();
#endif /* CONFIG_SW_COEXIST_ENABLE */

	if (ble_stack_enable() != 0) {
		ret = ESP_FAIL;
		goto error;
	}

	if (r_ble_controller_enable(mode) != 0) {
		ret = ESP_FAIL;
		goto error;
	}
	ble_controller_status = ESP_BT_CONTROLLER_STATUS_ENABLED;
	return ESP_OK;

error:
#if CONFIG_SW_COEXIST_ENABLE
	coex_disable();
#endif
	esp_btbb_disable();
	if (s_ble_active) {
		esp_phy_disable(PHY_MODEM_BT);
		s_ble_active = false;
	}
	return ret;
}

esp_err_t esp_bt_controller_disable(void)
{
	if (ble_controller_status < ESP_BT_CONTROLLER_STATUS_ENABLED) {
		LOG_WRN("invalid controller state");
		return ESP_FAIL;
	}
	if (r_ble_controller_disable() != 0) {
		return ESP_FAIL;
	}
#if CONFIG_SW_COEXIST_ENABLE
	coex_disable();
#endif
	esp_btbb_disable();
	if (s_ble_active) {
		esp_phy_disable(PHY_MODEM_BT);
		s_ble_active = false;
	}
	ble_controller_status = ESP_BT_CONTROLLER_STATUS_INITED;
	return ESP_OK;
}

esp_err_t esp_bt_controller_mem_release(esp_bt_mode_t mode)
{
	LOG_WRN("%s not implemented, return OK", __func__);
	return ESP_OK;
}

esp_err_t esp_bt_mem_release(esp_bt_mode_t mode)
{
	LOG_WRN("%s not implemented, return OK", __func__);
	return ESP_OK;
}

esp_bt_controller_status_t esp_bt_controller_get_status(void)
{
	return ble_controller_status;
}

esp_err_t esp_ble_tx_power_set(esp_ble_power_type_t power_type, esp_power_level_t power_level)
{
	esp_err_t stat = ESP_FAIL;

	switch (power_type) {
	case ESP_BLE_PWR_TYPE_DEFAULT:
		if (r_ble_txpwr_set(ESP_BLE_ENHANCED_PWR_TYPE_DEFAULT, 0, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	case ESP_BLE_PWR_TYPE_ADV:
		if (r_ble_txpwr_set(ESP_BLE_ENHANCED_PWR_TYPE_ADV, 0xFF, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	case ESP_BLE_PWR_TYPE_SCAN:
		if (r_ble_txpwr_set(ESP_BLE_ENHANCED_PWR_TYPE_SCAN, 0, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	case ESP_BLE_PWR_TYPE_CONN_HDL0:
	case ESP_BLE_PWR_TYPE_CONN_HDL1:
	case ESP_BLE_PWR_TYPE_CONN_HDL2:
	case ESP_BLE_PWR_TYPE_CONN_HDL3:
	case ESP_BLE_PWR_TYPE_CONN_HDL4:
	case ESP_BLE_PWR_TYPE_CONN_HDL5:
	case ESP_BLE_PWR_TYPE_CONN_HDL6:
	case ESP_BLE_PWR_TYPE_CONN_HDL7:
	case ESP_BLE_PWR_TYPE_CONN_HDL8:
		if (r_ble_txpwr_set(ESP_BLE_ENHANCED_PWR_TYPE_CONN, power_type, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	default:
		stat = ESP_ERR_NOT_SUPPORTED;
		break;
	}

	return stat;
}

esp_err_t esp_ble_tx_power_set_enhanced(esp_ble_enhanced_power_type_t power_type, uint16_t handle,
					esp_power_level_t power_level)
{
	esp_err_t stat = ESP_FAIL;
	switch (power_type) {
	case ESP_BLE_ENHANCED_PWR_TYPE_DEFAULT:
		if (r_ble_txpwr_set(ESP_BLE_ENHANCED_PWR_TYPE_DEFAULT, 0, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	case ESP_BLE_ENHANCED_PWR_TYPE_SCAN:
	case ESP_BLE_ENHANCED_PWR_TYPE_INIT:
		if (r_ble_txpwr_set(ESP_BLE_ENHANCED_PWR_TYPE_SCAN, 0, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	case ESP_BLE_ENHANCED_PWR_TYPE_ADV:
	case ESP_BLE_ENHANCED_PWR_TYPE_CONN:
		if (r_ble_txpwr_set(power_type, handle, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	default:
		stat = ESP_ERR_NOT_SUPPORTED;
		break;
	}

	return stat;
}

esp_power_level_t esp_ble_tx_power_get(esp_ble_power_type_t power_type)
{
	int tx_level = 0;

	switch (power_type) {
	case ESP_BLE_PWR_TYPE_DEFAULT:
		tx_level = r_ble_txpwr_get(ESP_BLE_ENHANCED_PWR_TYPE_DEFAULT, 0);
		break;
	case ESP_BLE_PWR_TYPE_ADV:
		tx_level = r_ble_txpwr_get(ESP_BLE_ENHANCED_PWR_TYPE_ADV, 0);
		break;
	case ESP_BLE_PWR_TYPE_SCAN:
		tx_level = r_ble_txpwr_get(ESP_BLE_ENHANCED_PWR_TYPE_SCAN, 0);
		break;
	case ESP_BLE_PWR_TYPE_CONN_HDL0:
	case ESP_BLE_PWR_TYPE_CONN_HDL1:
	case ESP_BLE_PWR_TYPE_CONN_HDL2:
	case ESP_BLE_PWR_TYPE_CONN_HDL3:
	case ESP_BLE_PWR_TYPE_CONN_HDL4:
	case ESP_BLE_PWR_TYPE_CONN_HDL5:
	case ESP_BLE_PWR_TYPE_CONN_HDL6:
	case ESP_BLE_PWR_TYPE_CONN_HDL7:
	case ESP_BLE_PWR_TYPE_CONN_HDL8:
		tx_level = r_ble_txpwr_get(ESP_BLE_ENHANCED_PWR_TYPE_CONN, power_type);
		break;
	default:
		return ESP_PWR_LVL_INVALID;
	}

	if (tx_level < 0) {
		return ESP_PWR_LVL_INVALID;
	}

	return (esp_power_level_t)tx_level;
}

esp_power_level_t esp_ble_tx_power_get_enhanced(esp_ble_enhanced_power_type_t power_type,
						uint16_t handle)
{
	int tx_level = 0;

	switch (power_type) {
	case ESP_BLE_ENHANCED_PWR_TYPE_DEFAULT:
		tx_level = r_ble_txpwr_get(ESP_BLE_ENHANCED_PWR_TYPE_DEFAULT, 0);
		break;
	case ESP_BLE_ENHANCED_PWR_TYPE_SCAN:
	case ESP_BLE_ENHANCED_PWR_TYPE_INIT:
		tx_level = r_ble_txpwr_get(ESP_BLE_ENHANCED_PWR_TYPE_SCAN, 0);
		break;
	case ESP_BLE_ENHANCED_PWR_TYPE_ADV:
	case ESP_BLE_ENHANCED_PWR_TYPE_CONN:
		tx_level = r_ble_txpwr_get(power_type, handle);
		break;
	default:
		return ESP_PWR_LVL_INVALID;
	}

	if (tx_level < 0) {
		return ESP_PWR_LVL_INVALID;
	}

	return (esp_power_level_t)tx_level;
}

#if CONFIG_ESP32_BT_LE_SM_LEGACY || CONFIG_ESP32_BT_LE_SM_SC
#define BLE_SM_KEY_ERR 0x17
#if CONFIG_ESP32_BT_LE_CRYPTO_STACK_MBEDTLS
#include "mbedtls/aes.h"
#if CONFIG_ESP32_BT_LE_SM_SC
#include "mbedtls/cipher.h"
#include "mbedtls/entropy.h"
#include "mbedtls/ctr_drbg.h"
#include "mbedtls/cmac.h"
#include "mbedtls/ecdh.h"
#include "mbedtls/ecp.h"

static mbedtls_ecp_keypair keypair;
#endif /* CONFIG_ESP32_BT_LE_SM_SC */

#endif /* CONFIG_ESP32_BT_LE_CRYPTO_STACK_MBEDTLS */

/* Based on Core Specification 4.2 Vol 3. Part H 2.3.5.6.1 */
static const uint8_t ble_sm_alg_dbg_priv_key[32] = {0x3f, 0x49, 0xf6, 0xd4, 0xa3, 0xc5, 0x5f, 0x38,
							0x74, 0xc9, 0xb3, 0xe3, 0xd2, 0x10, 0x3f, 0x50,
							0x4a, 0xff, 0x60, 0x7b, 0xeb, 0x40, 0xb7, 0x99,
							0x58, 0x99, 0xb8, 0xa6, 0xcd, 0x3c, 0x1a, 0xbd};

