zephyrproject-rtos/hal_espressif/zephyr/esp32h2/src/bt/esp_bt_adapter.c
int ble_sm_alg_gen_dhkey(const uint8_t *peer_pub_key_x, const uint8_t *peer_pub_key_y,
			 const uint8_t *our_priv_key, uint8_t *out_dhkey)
{
	uint8_t dh[32];
	uint8_t pk[64];
	uint8_t priv[32];
	int rc = BLE_SM_KEY_ERR;

	swap_buf(pk, peer_pub_key_x, 32);
	swap_buf(&pk[32], peer_pub_key_y, 32);
	swap_buf(priv, our_priv_key, 32);

#if CONFIG_ESP32_BT_LE_CRYPTO_STACK_MBEDTLS
	struct mbedtls_ecp_point pt = {0}, Q = {0};
	mbedtls_mpi z = {0}, d = {0};
	mbedtls_ctr_drbg_context ctr_drbg = {0};
	mbedtls_entropy_context entropy = {0};

	uint8_t pub[65] = {0};
	/* Hardcoded first byte of pub key for MBEDTLS_ECP_PF_UNCOMPRESSED */
	pub[0] = 0x04;
	memcpy(&pub[1], pk, 64);

	/* Initialize the required structures here */
	mbedtls_ecp_point_init(&pt);
	mbedtls_ecp_point_init(&Q);
	mbedtls_ctr_drbg_init(&ctr_drbg);
	mbedtls_entropy_init(&entropy);
	mbedtls_mpi_init(&d);
	mbedtls_mpi_init(&z);

	/* Below 3 steps are to validate public key on curve secp256r1 */
	if (mbedtls_ecp_group_load(&keypair.MBEDTLS_PRIVATE(grp), MBEDTLS_ECP_DP_SECP256R1) != 0) {
		goto exit;
	}

	if (mbedtls_ecp_point_read_binary(&keypair.MBEDTLS_PRIVATE(grp), &pt, pub, 65) != 0) {
		goto exit;
	}

	if (mbedtls_ecp_check_pubkey(&keypair.MBEDTLS_PRIVATE(grp), &pt) != 0) {
		goto exit;
	}

	/* Set PRNG */
	if ((rc = mbedtls_ctr_drbg_seed(&ctr_drbg, mbedtls_entropy_func, &entropy, NULL, 0)) != 0) {
		goto exit;
	}

	/* Prepare point Q from pub key */
	if (mbedtls_ecp_point_read_binary(&keypair.MBEDTLS_PRIVATE(grp), &Q, pub, 65) != 0) {
		goto exit;
	}

	if (mbedtls_mpi_read_binary(&d, priv, 32) != 0) {
		goto exit;
	}

	rc = mbedtls_ecdh_compute_shared(&keypair.MBEDTLS_PRIVATE(grp), &z, &Q, &d,
					 mbedtls_ctr_drbg_random, &ctr_drbg);
	if (rc != 0) {
		goto exit;
	}

	rc = mbedtls_mpi_write_binary(&z, dh, 32);
	if (rc != 0) {
		goto exit;
	}

exit:
	mbedtls_ecp_point_free(&pt);
	mbedtls_mpi_free(&z);
	mbedtls_mpi_free(&d);
	mbedtls_ecp_point_free(&Q);
	mbedtls_entropy_free(&entropy);
	mbedtls_ctr_drbg_free(&ctr_drbg);
	if (rc != 0) {
		return BLE_SM_KEY_ERR;
	}

#endif /* CONFIG_ESP32_BT_LE_CRYPTO_STACK_MBEDTLS */

	swap_buf(out_dhkey, dh, 32);
	return 0;
}

#if CONFIG_ESP32_BT_LE_CRYPTO_STACK_MBEDTLS
static int mbedtls_gen_keypair(uint8_t *public_key, uint8_t *private_key)
{
	int rc = BLE_SM_KEY_ERR;
	mbedtls_entropy_context entropy = {0};
	mbedtls_ctr_drbg_context ctr_drbg = {0};

	mbedtls_entropy_init(&entropy);
	mbedtls_ctr_drbg_init(&ctr_drbg);
	mbedtls_ecp_keypair_init(&keypair);

	if ((rc = mbedtls_ctr_drbg_seed(&ctr_drbg, mbedtls_entropy_func, &entropy, NULL, 0)) != 0) {
		goto exit;
	}

	if ((rc = mbedtls_ecp_gen_key(MBEDTLS_ECP_DP_SECP256R1, &keypair, mbedtls_ctr_drbg_random,
					  &ctr_drbg)) != 0) {
		goto exit;
	}

	if ((rc = mbedtls_mpi_write_binary(&keypair.MBEDTLS_PRIVATE(d), private_key, 32)) != 0) {
		goto exit;
	}

	size_t olen = 0;
	uint8_t pub[65] = {0};

	if ((rc = mbedtls_ecp_point_write_binary(
			 &keypair.MBEDTLS_PRIVATE(grp), &keypair.MBEDTLS_PRIVATE(Q),
			 MBEDTLS_ECP_PF_UNCOMPRESSED, &olen, pub, 65)) != 0) {
		goto exit;
	}

	memcpy(public_key, &pub[1], 64);

exit:
	mbedtls_ctr_drbg_free(&ctr_drbg);
	mbedtls_entropy_free(&entropy);
	if (rc != 0) {
		mbedtls_ecp_keypair_free(&keypair);
		return BLE_SM_KEY_ERR;
	}

	return 0;
}
#endif /* CONFIG_ESP32_BT_LE_CRYPTO_STACK_MBEDTLS */

/**
 * pub: 64 bytes
 * priv: 32 bytes
 */
int ble_sm_alg_gen_key_pair(uint8_t *pub, uint8_t *priv)
{
#if CONFIG_ESP32_BT_LE_SM_SC_DEBUG_KEYS
	swap_buf(pub, ble_sm_alg_dbg_pub_key, 32);
	swap_buf(&pub[32], &ble_sm_alg_dbg_pub_key[32], 32);
	swap_buf(priv, ble_sm_alg_dbg_priv_key, 32);
#else
	uint8_t pk[64];

	do {
#if CONFIG_ESP32_BT_LE_CRYPTO_STACK_MBEDTLS
		if (mbedtls_gen_keypair(pk, priv) != 0) {
			return BLE_SM_KEY_ERR;
		}
#endif /* CONFIG_ESP32_BT_LE_CRYPTO_STACK_MBEDTLS */
		/* Make sure generated key isn't debug key. */
	} while (memcmp(priv, ble_sm_alg_dbg_priv_key, 32) == 0);

	swap_buf(pub, pk, 32);
	swap_buf(&pub[32], &pk[32], 32);
	swap_in_place(priv, 32);
#endif /* CONFIG_ESP32_BT_LE_SM_SC_DEBUG_KEYS */
	return 0;
}

#endif /* CONFIG_ESP32_BT_LE_SM_LEGACY || CONFIG_ESP32_BT_LE_SM_SC */

int IRAM_ATTR ble_capture_info_user_handler(uint8_t type, uint32_t reason, uint32_t param1,
						uint32_t param2)
{
	int i;

	switch (type) {
	case 0:
		for (i = 0; i < 2; i++) {
			esp_ble_controller_info_capture(0x010101);
		}
#if CONFIG_ESP32_BT_LE_DEBUG_REMAIN_SCENE_ENABLED
		uintptr_t sp;
		__asm__ volatile("mv %0, sp" : "=r"(sp));
		esp_gdbstub_panic_handler(&sp);
#endif /* CONFIG_ESP32_BT_LE_DEBUG_REMAIN_SCENE_ENABLED */
		break;
#if CONFIG_ESP32_BT_LE_ASSERT_WHEN_ABNORMAL_DISCONN_ENABLED
	case 1:
		if ((reason == 0x08) || (reason == 0x3d) || (reason == 0x28)) {
			osi_assert_wrapper(__LINE__, __func__, type, reason);
		}
		break;
#endif /* CONFIG_ESP32_BT_LE_ASSERT_WHEN_ABNORMAL_DISCONN_ENABLED */
	default:
		break;
	}
	return 0;
}
